{
    "title": "Welcome to my portfolio",
    "about": "About",
    "experience": "Experience",
    "education": "Education",
    "educationInstitution": "Impacta Technology College",
    "educationCourse": "Associate Degree in Systems Analysis and Development",
    "educationDescription": "Focus on practical development with Java, solid programming principles (SOLID), and clean code. Included courses on requirements gathering and systems analysis.",
    "educationTime": "February 2014 to December 2016",
    "skills": "Skills",
    "interests": "Interests",
    "interestsText": "In my spare time, I enjoy exploring the mechanics behind motorcycles and computers. I have a strong appreciation for literature and philosophy, and I often spend my free time reading, walking, enjoying specialty coffee, and watching films.",
    "awards": "Awards & Certifications",
    "summary": "Backend developer with solid experience in C# (.NET) and Node.js, focused on performance, scalability, and clean code practices. Proven track record in building RESTful APIs, microservices, and integrating with both relational and non-relational databases. Skilled in automated testing, CI/CD pipelines, containers (Docker), and clean architecture. I aim to deliver simple solutions to complex problems and generate real business value. Communicative, deadline-driven, and experienced in agile environments (Scrum/Kanban).",
    "country": "Brazil",
    "seniorSoftwareEngineer": "Senior Software Engineer",
    "mzJob": "Developed RESTful APIs in TypeScript and microservices in Python to automate the generation of detailed financial reports, with inputs and outputs handled via Excel spreadsheets. These reports provided clearer and more precise visual data, directly impacting thousands of investors by enabling more accurate analysis of stock performance and supporting strategic buy and sell decisions in the financial market.",
    "envoltiJob": "Worked on two main projects. In the first, I contributed to the development of a cryptocurrency trading platform using Nest.js (backend) and Next.js (frontend), with integrations to the Binance API. The platform provided users with clearer insights into token and crypto exchange opportunities, helping them make better-informed trading decisions in a complex market. In the second project, I led requirements gathering and task planning for a mobile app migration from Swift to Flutter, reducing development costs and increasing autonomy for the client’s team to implement new features.",
    "actJob": "I participated in an international project for Moderna, where I was responsible for migrating a legacy application from Angular 1 to Angular 13. This technological upgrade not only modernized the codebase but also simplified the addition of new features, made ongoing maintenance easier, and improved the scalability of the application, providing a more robust platform that can evolve to meet the company's future needs.",
    "remessaJob": "Responsible for CRM software and customer segmentation processes, working with HubSpot integrations, data enrichment, and processing. Utilized Node.js, RabbitMQ, AWS, PostgreSQL, and Jest. Contributed to optimizing the sales pipeline by providing the sales team with faster and clearer insights into customer profiles and their position in the funnel, which directly supported increased conversion rates and more strategic decision-making.",
    "languageAndFrameworks": "👨‍💻 Languages & Frameworks",
    "databases": "🗄️ Databases",
    "cloud": "☁️ Cloud & Infrastructure",
    "tools": "🔧 Tools and Integrations",
    "goods": "📐 Good Practices & Architecture",
    "microservices": "Microservices architecture",
    "agile": "Agile methodologies (Scrum/Kanban)",
    "integration": "Integration between legacy and modern systems",
    "erp": "ERP Integrations",
    "requirements": "Requirements gathering"
}

