{
    "title": "Bem-vindo ao meu portfólio",
    "about": "Sobre",
    "experience": "Experiência",
    "education": "Formação",
    "educationInstitution": "Faculdade Impacta de Tecnologia",
    "educationCourse": "Análise e Desenvolvimento de Sistemas",
    "educationDescription": "Foco no desenvolvimento prático com Java, princípios sólidos de programação (SOLID) e código limpo. Cursos incluídos sobre coleta de requisitos e análise de sistemas.",
    "educationTime": "Fevereiro de 2014 a Dezembro de 2016",
    "skills": "Habilidades",
    "interests": "Interesses",
    "interestsText": "No meu tempo livre, gosto de entender o funcionamento de motocicletas e computadores. Também tenho grande interesse por literatura e filosofia, dedicando parte do meu lazer à leitura, caminhadas, degustação de cafés especiais e assistir a filmes.",
    "awards": "Prêmios e Certificações",
    "summary": "Desenvolvedor backend com forte experiência em C# (.NET) e Node.js, focado em performance, escalabilidade e boas práticas de código. Tenho histórico comprovado em projetos de APIs REST, microsserviços e integrações com bancos de dados relacionais e não relacionais. Trabalho com testes automatizados, CI/CD, containers (Docker) e arquitetura limpa. Busco aplicar soluções simples para problemas complexos e agregar valor real ao negócio. Comunicativo, comprometido com prazos e habituado a ambientes ágeis (Scrum/Kanban).",
    "country": "Brazil",
    "seniorSoftwareEngineer": "Senior Software Engineer",
    "mzJob": "Desenvolvi APIs RESTful em TypeScript e microsserviços em Python para automatizar a geração de relatórios financeiros detalhados, com entradas e saídas processadas por planilhas do Excel. Esses relatórios forneceram dados visuais mais claros e precisos, impactando diretamente milhares de investidores, permitindo análises mais precisas do desempenho das ações e apoiando decisões estratégicas de compra e venda no mercado financeiro.",
    "envoltiJob": "Trabalhei em dois projetos principais. No primeiro, contribuí para o desenvolvimento de uma plataforma de negociação de criptomoedas usando Nest.js (backend) e Next.js (frontend), com integrações à API da Binance. A plataforma proporcionou aos usuários insights mais claros sobre oportunidades de negociação de tokens e criptomoedas, ajudando-os a tomar decisões de negociação mais bem informadas em um mercado complexo. No segundo projeto, liderei a coleta de requisitos e o planejamento de tarefas para a migração de um aplicativo móvel do Swift para o Flutter, reduzindo os custos de desenvolvimento e aumentando a autonomia da equipe do cliente para implementar novos recursos.",
    "actJob": "Participei de um projeto internacional para a Moderna, onde fui responsável por migrar um aplicativo legado do Angular 1 para o Angular 13. Essa atualização tecnológica não apenas modernizou a base de código, mas também simplificou a adição de novos recursos, facilitou a manutenção contínua e melhorou a escalabilidade do aplicativo, fornecendo uma plataforma mais robusta que pode evoluir para atender às necessidades futuras da empresa.",
    "remessaJob": "Responsável pelo software de CRM e processos de segmentação de clientes, atuando com integrações ao HubSpot, enriquecimento e processamento de dados. Utilização de Node.js, RabbitMQ, AWS, PostgreSQL e Jest. Contribuímos para otimizar o funil de vendas ao fornecer à equipe comercial informações mais rápidas e precisas sobre os clientes e sua posição no processo de compra, o que facilitou decisões mais estratégicas e aumentou a taxa de conversão.",
    "languageAndFrameworks": "👨‍💻 Linguagens & Frameworks",
    "databases": "🗄️ Banco de dados",
    "cloud": "☁️ Cloud & Infra Estrutura",
    "tools": "🔧 Ferramentas e Integrações",
    "goods": "📐 Boas Práticas & Arquitetura",
    "microservices": "Micro-serviços e Arquitetura",
    "agile": "Metodologias ágeis (Scrum/Kanban)",
    "integration": "Integrações entre sistemas legados e modernos",
    "erp": "Integrações com ERP",
    "requirements": "Levantamentos de requisitos"
}